perf/stress/rates_put.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: 'artillery-api'

  pool: 400

  phases:
    - name: Ramp up
      duration: 15
      arrivalRate: 50
      rampTo: 250
    - name: Plain
      duration: 10
      arrivalRate: 300
    - name: Ramp down
      duration: 15
      arrivalRate: 250
      rampTo: 50
    - name: Stop
      duration: 30
      arrivalRate: 1

scenarios:
  - name: Put Rates STRESS (PUT /rates)
    flow:
      - put:
          url: '/rates'
          json:
            baseCurrency: 'USD'
            counterCurrency: 'ARS'
            rate: 1000